# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

n = int(input('Введите трехзначное число: '))
sum = 0
while n > 0:
    i = n % 10
    sum = sum + i
    n = n // 10
print (sum)